const rw = {
    "component": {
        "basic_content": "ƀȧşīƈ ƈǿƞŧḗƞŧ",
        "view_container": "ṽīḗẇ ƈǿƞŧȧīƞḗř",
        "form": "ƒǿřḿ",
        "navigation": "ƞȧṽīɠȧŧīǿƞ",
        "media_component": "ḿḗḓīȧ ƈǿḿƥǿƞḗƞŧ",
        "other": "ǿŧħḗř",
        "component_tip": "Ŧħḗ ƒǿŀŀǿẇīƞɠ ẇīŀŀ şħǿẇ ŧħḗ ǿƒƒīƈīȧŀ ƈǿḿƥǿƞḗƞŧ ƈȧƥȧƀīŀīŧīḗş ǿƒ ŧħḗ ḿīƞī ƥřǿɠřȧḿ. Ŧħḗ ƈǿḿƥǿƞḗƞŧ şŧẏŀḗş ȧřḗ ƒǿř řḗƒḗřḗƞƈḗ ǿƞŀẏ. Ŧħḗ ḓḗṽḗŀǿƥḗř ƈȧƞ ƈŭşŧǿḿīẑḗ ŧħḗ ƈǿḿƥǿƞḗƞŧ şŧẏŀḗ ȧƈƈǿřḓīƞɠ ŧǿ ŧħḗīř ǿẇƞ ƞḗḗḓş. Ƒǿř ḓḗŧȧīŀş ǿƒ ŧħḗ ƥřǿƥḗřŧẏ ƥȧřȧḿḗŧḗřş, şḗḗ ŧħḗ ḓǿƈŭḿḗƞŧȧŧīǿƞ.",
        "component": "ƈǿḿƥǿƞḗƞŧ",
        "map": "ḿȧƥ",
    },
    "button": {
        "button": "ƀŭŧŧǿƞ",
        "main_operation_normal": "ƥȧɠḗ ḿȧīƞ ǿƥḗřȧŧīǿƞ ƞǿřḿȧŀ",
        "main_operation_loading": "ƥȧɠḗ ḿȧīƞ ǿƥḗřȧŧīǿƞ Ŀǿȧḓīƞɠ",
        "main_operation_disabled": "ƥȧɠḗ ḿȧīƞ ǿƥḗřȧŧīǿƞ Ḓīşȧƀŀḗ",
        "secondary_operation_normal": "ƥȧɠḗ şḗƈǿƞḓȧřẏ ǿƥḗřȧŧīǿƞ Ƞǿřḿȧŀ",
        "secondary_operation_loading": "ƥȧɠḗ şḗƈǿƞḓȧřẏ ǿƥḗřȧŧīǿƞ Ŀǿȧḓīƞɠ",
        "secondary_operation_disabled": "ƥȧɠḗ şḗƈǿƞḓȧřẏ ǿƥḗřȧŧīǿƞ Ḓīşȧƀŀḗḓ",
        "warning_operation_normal": "ẇȧřƞīƞɠ ǿƥḗřȧŧīǿƞ Ƞǿřḿȧŀ",
        "warning_operation_loading": "ẇȧřƞīƞɠ ǿƥḗřȧŧīǿƞ Ŀǿȧḓīƞɠ",
        "warning_operation_disabled": "ẇȧřƞīƞɠ ǿƥḗřȧŧīǿƞ Ḓīşȧƀŀḗḓ",
        "disabled_button": "ḓīşȧƀŀḗḓ ƀŭŧŧǿƞ",
        "type": "ŧẏƥḗ",
        "disabled_btn": "ḓīşȧƀŀḗḓ ƀŭŧŧǿƞ",
        "primary_btn": "ƥřīḿȧřẏ ƀŭŧŧǿƞ",
        "secondary_btn": "şḗƈǿƞḓȧřẏ ƀŭŧŧǿƞ",
        "dashed_btn": "ḓȧşħḗḓ ƀŭŧŧǿƞ",
        "warn_btn": "ẇȧřƞ ƀŭŧŧǿƞ",
        "danger_btn": "ḓȧƞɠḗř ƀŭŧŧǿƞ",
        "text_btn": "ŧḗẋŧ ƀŭŧŧǿƞ",
        "size": "şīẑḗ",
        "huge_size": "ħŭɠḗ şīẑḗ",
        "large_size": "ŀȧřɠḗ şīẑḗ",
        "middle_size": "ḿīḓḓŀḗ şīẑḗ",
        "mini_size": "şḿȧŀŀ şīẑḗ",
        "shape": "şħȧƥḗ",
        "rectangle_shape": "ƞǿ řǿŭƞḓ ƈǿřƞḗřş",
        "normal_shape": "ƞǿřḿȧŀ řǿŭƞḓ ƈǿřƞḗřş",
        "round_shape": "ƒŭŀŀ řǿŭƞḓḗḓ ƈǿřƞḗř",
        "ghost_btn": "ɠħǿşŧ ƀŭŧŧǿƞ",
        "loading": "ŀǿȧḓīƞɠ"
    },
    "canvas": {
        "generate_img": "ɠḗƞḗřȧŧḗ īḿȧɠḗ",
        "start_draw": "şŧȧřŧ ḓřȧẇīƞɠ",
        "end_draw": "ḗƞḓ ḓřȧẇīƞɠ"
    },
    "checkbox": {
        "default_style": "ḓḗƒȧŭŀŧ şŧẏŀḗ",
        "selected": "şḗŀḗƈŧḗḓ",
        "unselected": "ŭƞşḗŀḗƈŧḗḓ",
        "recommend_display_style": "řḗƈǿḿḿḗƞḓ ḓīşƥŀȧẏ şŧẏŀḗ"
    },
    "form": {
        "option_one": "ǿƥŧīǿƞ ǿƞḗ",
        "option_two": "ǿƥŧīǿƞ ŧẇǿ",
        "submit": "şŭƀḿīŧ",
        "reset": "řḗşḗŧ",
        "input_placeholder": "Ŧħīş īş ȧƞ īƞƥŭŧ ƀǿẋ"
    },
    "icon": {
        "success": "şŭƈƈḗşş",
        "success_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ŧħȧŧ ŧħḗ ǿƥḗřȧŧīǿƞ ẇȧş ƈǿḿƥŀḗŧḗḓ şŭƈƈḗşşƒŭŀŀẏ",
        "prompt": "ƥřǿḿƥŧ",
        "prompt_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ īƞƒǿřḿȧŧīǿƞ ƥřǿḿƥŧş; ȧŀşǿ ŭşḗḓ ƒǿř ŀȧƈķ ǿƒ ƈǿƞḓīŧīǿƞȧŀ ǿƥḗřȧŧīǿƞ īƞŧḗřƈḗƥŧīǿƞ, ƥřǿḿƥŧīƞɠ ŭşḗřş ẇīŧħ ŧħḗ řḗɋŭīřḗḓ īƞƒǿřḿȧŧīǿƞ",
        "normal_warning": "ƞǿřḿȧŀ ẇȧřƞīƞɠ",
        "normal_warning_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ȧ şīŧŭȧŧīǿƞ ŧħȧŧ ẇīŀŀ ƈȧŭşḗ ƈḗřŧȧīƞ ƈǿƞşḗɋŭḗƞƈḗş ȧƒŧḗř ŧħḗ ǿƥḗřȧŧīǿƞ; ȧŀşǿ ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ƞḗɠȧŧīṽḗ řḗşŭŀŧş ḓŭḗ ŧǿ şẏşŧḗḿ řḗȧşǿƞş",
        "strong_warning": "şŧřǿƞɠ ẇȧřƞīƞɠ",
        "strong_warning_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ƞḗɠȧŧīṽḗ řḗşŭŀŧş ḓŭḗ ŧǿ ŭşḗř řḗȧşǿƞş; ȧŀşǿ ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ŧħḗ ƈǿƞşḗɋŭḗƞƈḗş ǿƒ ŭƞşŭşŧȧīƞȧƀŀḗ řḗƈǿṽḗřẏ ȧƒŧḗř ǿƥḗřȧŧīǿƞ",
        "wait": "ẇȧīŧ",
        "wait_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ẇȧīŧ, ŧḗŀŀ ŧħḗ ŭşḗř ŧħȧŧ ŧħḗ řḗşŭŀŧ ħȧş ŧǿ ẇȧīŧ",
        "mulit_icon_selected": "Ḿŭŀŧī-şḗŀḗƈŧīǿƞ ƈǿƞŧřǿŀ īƈǿƞ şḗŀḗƈŧḗḓ",
        "mulit_icon_selected_tip": "Ŭşḗḓ īƞ ȧ ḿŭŀŧī-şḗŀḗƈŧ ƈǿƞŧřǿŀ ŧǿ īƞḓīƈȧŧḗ ŧħȧŧ ŧħḗ īŧḗḿ ħȧş ƀḗḗƞ şḗŀḗƈŧḗḓ",
        "mulit_icon_unselected": "Ḿŭŀŧī-şḗŀḗƈŧīǿƞ ƈǿƞŧřǿŀ īƈǿƞ ƞǿŧ şḗŀḗƈŧḗḓ",
        "mulit_icon_selected_tip": "Ŭşḗḓ īƞ ḿŭŀŧīƥŀḗ şḗŀḗƈŧīǿƞ ƈǿƞŧřǿŀş, īƞḓīƈȧŧīƞɠ ŧħȧŧ ŧħḗ īŧḗḿ ƈȧƞ ƀḗ şḗŀḗƈŧḗḓ ƀŭŧ ƞǿŧ ẏḗŧ şḗŀḗƈŧḗḓ",
        "error_message": "ḗřřǿř ḿḗşşȧɠḗ",
        "error_message_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ȧƞ ḗřřǿř īƞ ŧħḗ ƒǿřḿ",
        "single_icon_selected": "Řȧḓīǿ ƈǿƞŧřǿŀ īƈǿƞ şḗŀḗƈŧḗḓ",
        "single_icon_unselected": "Ŭşḗḓ īƞ ȧ řȧḓīǿ ƈǿƞŧřǿŀ ŧǿ īƞḓīƈȧŧḗ ŧħȧŧ ŧħḗ īŧḗḿ ħȧş ƀḗḗƞ şḗŀḗƈŧḗḓ",
        "download": "ḓǿẇƞŀǿȧḓ",
        "download_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ḓǿẇƞŀǿȧḓȧƀŀḗ",
        "form_prompt": "ƥřǿḿƥŧ",
        "form_prompt_tip": "Ŭşḗḓ ŧǿ īƞḓīƈȧŧḗ ŧħȧŧ ŧħḗřḗ īş ȧ ḿḗşşȧɠḗ īƞ ŧħḗ ƒǿřḿ",
        "stop": "Şŧǿƥ ǿř ƈŀǿşḗ",
        "form_stop": "Ŭşḗḓ īƞ ȧ ƒǿřḿ ŧǿ īƞḓīƈȧŧḗ ƈŀǿşḗ ǿř şŧǿƥ",
        "search": "şḗȧřƈħ",
        "serach_tip": "Ŭşḗḓ īƞ şḗȧřƈħ ƈǿƞŧřǿŀş ŧǿ īƞḓīƈȧŧḗ şḗȧřƈħȧƀŀḗ",
        "type": "ŧẏƥḗ",
        "color": "ƈǿŀǿř",
        "size": "şīẑḗ"
    },
    "image": {
        "local_image": "ŀǿƈȧŀ īḿȧɠḗ",
        "net_image": "ẇḗƀ īḿȧɠḗ"
    },
    "input": {
        "auto_focus_input": "Īƞƥŭŧ ŧħȧŧ ƈȧƞ ƀḗ ȧŭŧǿḿȧŧīƈȧŀŀẏ ƒǿƈŭşḗḓ",
        "auto_focus_placeholder": "Ẇīŀŀ ɠḗŧ ŧħḗ ƒǿƈŭş",
        "maxlength_input": "Īƞƥŭŧ ŧħȧŧ ƈǿƞŧřǿŀş ŧħḗ ḿȧẋīḿŭḿ īƞƥŭŧ ŀḗƞɠŧħ",
        "maxlength_input_placeholder": "Ŧħḗ ḿȧẋīḿŭḿ īƞƥŭŧ ŀḗƞɠŧħ īş 10",
        "realtime_input": "Ɠḗŧ ŧħḗ īƞƥŭŧ ṽȧŀŭḗ īƞ řḗȧŀ ŧīḿḗ:",
        "syncview_placeholder": "Īƞƥŭŧ şẏƞƈ ŧǿ ṽīḗẇ",
        "control_input": "Ƈǿƞŧřǿŀ īƞƥŭŧ",
        "control_placeholder": "Ŧẇǿ ƈǿƞşḗƈŭŧīṽḗ 1 ẇīŀŀ ƀḗƈǿḿḗ 2",
        "control_keyboard": "Ƈǿƞŧřǿŀ ķḗẏƀǿȧřḓ īƞƥŭŧ",
        "control_keyboard_placeholder": "Ḗƞŧḗř 123 ŧǿ ȧŭŧǿḿȧŧīƈȧŀŀẏ ƈŀǿşḗ ŧħḗ ķḗẏƀǿȧřḓ",
        "number_input": "Īƞƥŭŧ ǿƒ ḓīɠīŧȧŀ īƞƥŭŧ",
        "number_input_placeholder": "ƞŭḿƀḗř īƞƥŭŧ ƥŀȧƈḗħǿŀḓḗř",
        "secret_input": "Ƥȧşşẇǿřḓ īƞƥŭŧ",
        "secret_input_placeholder": "Ŧħīş īş ȧ ƥȧşşẇǿřḓ īƞƥŭŧ ƀǿẋ",
        "decimal_input": "Īƞƥŭŧ ẇīŧħ ȧ ḓḗƈīḿȧŀ ƥǿīƞŧ",
        "decimal_input_placeholder": "Ƞŭḿḗřīƈ ķḗẏƥȧḓ ẇīŧħ ḓḗƈīḿȧŀ ƥǿīƞŧ",
        "id_input": "ĪḒ īƞƥŭŧ",
        "id_input_placeholder": "ĪḒ ƈȧřḓ īƞƥŭŧ ķḗẏƀǿȧřḓ",
        "color_input": "Īƞƥŭŧ ŧħȧŧ ƈǿƞŧřǿŀş ŧħḗ ƈǿŀǿř ǿƒ ŧħḗ ƥŀȧƈḗħǿŀḓḗř",
        "color_input_placeholder": "Ƥŀȧƈḗħǿŀḓḗř ƒǿƞŧ īş řḗḓ"
    },
    "label": {
        "label_title_one": "Ƒǿřḿ ƈǿḿƥǿƞḗƞŧ īƞşīḓḗ ŧħḗ ŀȧƀḗŀ",
        "label_title_two": "Ŀȧƀḗŀ ŭşḗş ƒǿř ŧǿ īḓḗƞŧīƒẏ ŧħḗ ƒǿřḿ ƈǿḿƥǿƞḗƞŧ",
        "label_title_three": "Ẇħḗƞ ŧħḗřḗ ȧřḗ ḿŭŀŧīƥŀḗ ŀȧƀḗŀş īƞ ŧħḗ ŀȧƀḗŀ, ŧħḗ ƒīřşŧ ǿƞḗ īş şḗŀḗƈŧḗḓ.",
        "option_one": "ǿƥŧīǿƞ ǿƞḗ",
        "option_two": "ǿƥŧīǿƞ ŧẇǿ",
        "default_one": "Ƈŀīƈķ ŧħḗ ŧḗẋŧ ŭƞḓḗř ŧħḗ ŀȧƀḗŀ ŧǿ şḗŀḗƈŧ ŧħḗ ƒīřşŧ ƈħḗƈķƀǿẋ ƀẏ ḓḗƒȧŭŀŧ."
    },
    "map": {
        "move_up": "ḿǿṽḗ ŭƥ",
        "show_marks_text": "ƈħḗƈķ īƒ ŧħḗ ḿȧřķḗřş ħȧṽḗ şħǿẇƞ",
        "move_to_location": "ḿǿṽḗ ŧǿ ŀǿƈȧŧīǿƞ",
        "scale_up": "ẑǿǿḿ+1 ḗȧƈħ ŧȧƥ"
        },
    "navigator": {
        "open_in_new_page": "ǿƥḗƞ īƞ ƞḗẇ ƥȧɠḗ",
        "open_in_current_page": "ǿƥḗƞ īƞ ƈŭřřḗƞŧ ƥȧɠḗ"
    },
    "picker": {
        "tip": "Ḿǿḓīƒẏ ḓȧŧȧ ȧƒŧḗř ŀǿƞɠ ƥřḗşşīƞɠ ƒǿř 5 şḗƈǿƞḓş",
        "current_option": "Ƈŭřřḗƞŧ Ǿƥŧīǿƞ: ",
        "custom_picker": "Ǿřḓīƞȧřẏ Ƥīƈķḗř",
        "custom_object_picker": "Ǿřḓīƞȧřẏ Ǿƀĵḗƈŧ Ƥīƈķḗř",
        "multiSelector": "ḾŭŀŧīŞḗŀḗƈŧǿř",
        "time_picker": "Ŧīḿḗ Ƥīƈķḗř",
        "date_picker": "Ḓȧŧḗ Ƥīƈķḗř"
    },
    "radio": {
        "default_style": "ḓḗƒȧŭŀŧ şŧẏŀḗ",
        "selected": "şḗŀḗƈŧḗḓ",
        "unselected": "ŭƞşḗŀḗƈŧḗḓ",
        "recommend_display_style": "řḗƈǿḿḿḗƞḓ ḓīşƥŀȧẏ şŧẏŀḗ"
    },
    "richtext": {
        "need_upload": "ƞḗḗḓ ŧǿ ŭƥŀǿȧḓ ȧƞ īḿȧɠḗ",
        "need_pickerview": "ƞḗḗḓ ƥīƈķḗřṼīḗẇ",
        "need_contact": "ƞḗḗḓ @ƈǿƞŧȧƈŧ",
        "need_emoji": "ḗƞŧḗř ȧƞ ḗẋƥřḗşşīǿƞ",
        "enable_return_key": "ƞḗḗḓ ŧǿ ḗƞŧḗř ẇħḗƞ ƈǿƞŧḗƞŧ īş ḗḿƥŧẏ",
        "pop_richtext": "ƥǿƥ ŭƥ řīƈħŧḗẋŧ ƀǿẋ"
    },
    "slider": {
        "set_step": "şḗŧ şŧḗƥ",
        "show_current_value": "şħǿẇ ƈŭřřḗƞŧ ṽȧŀŭḗ",
        "set_range": "şḗŧ ḿīƞīḿŭḿ/ḿȧẋīḿŭḿ"
    },
    "swiper": {
        "indicator": "īƞḓīƈȧŧǿř",
        "auto_play": "ȧŭŧǿ ƥŀȧẏ",
        "vertical_direction": "ṽḗřŧīƈȧŀ",
        "change_duration": "şŀīḓḗ ŧřȧƞşīŧīǿƞ ŧīḿḗ(ḿş)",
        "gap_duration": "ȧŭŧǿ ƥŀȧẏ īƞŧḗřṽȧŀ(ḿş)"
    },
    "switch": {
        "default_style": "ḓḗƒȧŭŀŧ şŧẏŀḗ",
        "selected": "ǿƥḗƞ",
        "unselected": "ƈŀǿşḗ",
        "recommend_display_style": "řḗƈǿḿḿḗƞḓ ḓīşƥŀȧẏ şŧẏŀḗ"
    },
    "textarea": {
        "height_auto_fix_textarea": "Ŧħḗ īƞƥŭŧ ȧřḗȧ īş ħīɠħŀẏ ȧḓȧƥŧīṽḗ ȧƞḓ ƞǿ şƈřǿŀŀ ƀȧřş ȧƥƥḗȧř",
        "auto_focus_textare": "Ŧħīş īş ȧ ŧḗẋŧȧřḗȧ ŧħȧŧ ƈȧƞ ƀḗ ȧŭŧǿḿȧŧīƈȧŀŀẏ ƒǿƈŭşḗḓ"
    },
    "video_component": {
        "play": "ƥŀȧẏ",
        "pause": "ƥȧŭşḗ",
        "stop_video": "stop",
        "enter_fullscreen": "enter fullscreen",
        "seek": "seek",
        "seek_position": "seconds to seek",
        "play_speed": "play speed",
        "speed": "video speed",
        "title": "Video Title"
    },
    "text": {
        "add_line": "ȧḓḓ ȧ ŀīƞḗ",
        "delete_line": "ḓḗŀḗŧḗ ȧ ŀīƞḗ"
    },
    "webview": {
        "open_webview_tip": "ƈŀīƈķ ŧǿ ǿƥḗƞ ẇḗƀṽīḗẇ",
        "page_url": "https://www.material.io/"
    },
    "scroll_view": {
        "horizontal_scroll": "Horizontal Scroll",
        "vertical_scroll": "Vertical Scroll"
    },
    "editor": {
        "title": "lark",
        "first_paragraph": "A one-stop solution to collaborating seamlessly, setting and tracking goals in a team, and inspiring organizations and individuals. Feishu, where the future of work is shaped.",
        "second_paragraph": "Run meetings with SamePage Method: Experimented within Feishu and built on Feishu Docs, the SamePage Method helps you drive better meeting results. Schedule smartly, read and comment shared documents during the meeting, get automatically generated meeting minutes after the meeting.",
        "last_paragraph": "Collaborate on Feishu Docs: Add any content you want on Feishu Docs to unlock your creative power. Get fragmented knowledge organized on Wiki and find what you need right away with Quicksearch. Make collaboration engaging for all and enable knowledge flow within an organization."
    },
    "api": {
        "open_ability": "ǿƥḗƞ ȧƀīŀīŧẏ",
        "login": 'login',
        "get_user_info": "ɠḗŧ ŭşḗř īƞƒǿḿȧŧīǿƞ",
        "share": "şħȧřḗ",
        "contact": "ƈǿƞŧȧƈŧ",
        "biometric": "şẏşŧḗḿ ȧŭŧħḗƞŧīƈȧŧīǿƞ",
        "password_verify": "ƥȧşşẇǿřḓ ṽḗřīƒẏ",
        "send_email": "şḗƞḓ ḗḿȧīŀ",
        "check_watermark": "ƈħḗƈķ ẇȧŧḗřḿȧřķ",
        "live_check": "ŀīṽḗ ƈħḗƈķ",
        "api_tip": "Ŧħḗ ḿīƞī ƥřǿɠřȧḿ īƞŧḗřƒȧƈḗ ƈȧƥȧƀīŀīŧīḗş ȧřḗ ḓḗḿǿƞşŧřȧŧḗḓ ƀḗŀǿẇ. Ŧħḗ şƥḗƈīƒīƈ ȧŧŧřīƀŭŧḗ ƥȧřȧḿḗŧḗřş ȧřḗ ḓḗŧȧīŀḗḓ īƞ ŧħḗ ḓḗṽḗŀǿƥḿḗƞŧ ḓǿƈŭḿḗƞŧȧŧīǿƞ.",
        "choose_chat": "ƈħǿǿşḗ-ƈħȧŧ",
        "send_msg_card": "send-message-card",
        "device_id": "ḓḗṽīƈḗ Īḓ",
        "authorized": "authorized",
        //network
        "network": "ƞḗŧẇǿřķ",
        "send_a_request": "şḗƞḓ ȧ řḗɋŭḗşŧ",
        "webSocket": "ẆḗƀŞǿƈķḗŧ",
        "upload_file": "ŭƥŀǿȧḓ ƒīŀḗ",
        "download_file": "ḓǿẇƞŀǿȧḓ ƒīŀḗ",
        //media
        "media": "ḿḗḓīȧ",
        "image": "īḿȧɠḗ",
        "recording": "řḗƈǿřḓīƞɠ",
        "file": "ƒīŀḗ",
        "audio": "ȧŭḓīǿ",
        "video": "ṽīḓḗǿ",
        //storage
        "storage": "şŧǿřȧɠḗ",
        //location
        "location": "ŀǿƈȧŧīǿƞ",
        "get_location": "ɠḗŧ ŀǿƈȧŧīǿƞ",
        "open_location": "ǿƥḗƞ ŀǿƈȧŧīǿƞ",
        "choose_location": "ƈħǿǿşḗ ŀǿƈȧŧīǿƞ",
        "get_location_status": "get location status",
        //device
        "device": "ḓḗṽīƈḗ",
        // launch query
        "launch_query": "ŀȧŭƞƈħ ɋŭḗřẏ",
        "show_payment": "show payment",
        "canvas": "ƈřḗȧŧḗ ƈȧƞṽȧş",
        "get_system_info": "ɠḗŧ şẏşŧḗḿ īƞƒǿ",
        "get_network_type": "ɠḗŧ ƞḗŧẇǿřķ şŧȧŧḗ",
        "monitor_network_change": "ḿǿƞīŧǿř ƞḗŧẇǿřķ ƈħȧƞɠḗ",
        "monitor_gravity_sensing_data": "ḿǿƞīŧǿř ɠřȧṽīŧẏ şḗƞşīƞɠ ḓȧŧȧ",
        "monitor_compass_data": "ḿǿƞīŧǿř ƈǿḿƥȧşş ḓȧŧȧ",
        "make_phone_call": "ḿȧķḗ ƥħǿƞḗ ƈȧŀŀ",
        "scan_code": "şƈȧƞ ƈǿḓḗ",
        "clipboard": "ƈŀīƥƀǿȧřḓ",
        "screen_brightness": "şƈřḗḗƞ ƀřīɠħŧƞḗşş",
        "vibrate": "ṽīƀřȧŧḗ",
        "monitor_user_screen_capture": "ḿǿƞīŧǿř ŭşḗř şƈřḗḗƞ ƈȧƥŧŭřḗ",
        //界面
        "interface": "īƞŧḗřƒȧƈḗ",
        "toast_tip": "şħǿẇ ḿḗşşȧɠḗ ƀǿẋ ŧǿȧşŧ",
        "modal_tip": "ḓīşƥŀȧẏ ḿǿḓȧŀ ƥǿƥ-ŭƥ ẇīƞḓǿẇ ḿǿḓȧŀ",
        "prompt_tip": "ḓīşƥŀȧẏ ḗḓīŧȧƀŀḗ ƥǿƥ-ŭƥ ẇīƞḓǿẇ ƥřǿḿƥŧ",
        "actionsheet_tip": "ḓīşƥŀȧẏ ŧħḗ ȧƈŧīǿƞ ḿḗƞŭ ȧƈŧīǿƞşħḗḗŧ",
        "set_navigation_bar_title": "şḗŧ ƞȧṽīɠȧŧīǿƞ ƀȧř ŧīŧŀḗ",
        "create_animation": "ƈřḗȧŧḗ ȧƞīḿȧŧīǿƞ",
        "page_position": "ƥȧɠḗ ƥǿşīŧīǿƞ",
        "pull_down_refresh": "ƥŭŀŀ ḓǿẇƞ řḗƒřḗşħ",
        //导航
        "navigation": "ƞȧṽīɠȧŧīǿƞ",
        // PC mode
        "mode": "ḿǿḓḗ",
        "api": "ȦƤĪ",
    },
    //tab-bar
    "set_tab_bar": {
        "tab_icon": "şḗŧ ŧȧƀ ŀǿɠǿ",
        "remove_icon": "řḗḿǿṽḗ ŧȧƀ ŀǿɠǿ",
        "show_dot": "ḓīşƥŀȧẏ řḗḓ ḓǿŧ",
        "remove_dot": "řḗḿǿṽḗ řḗḓ ḓǿŧ",
        "custom_style": "ƈŭşŧǿḿ Ŧȧƀ şŧẏŀḗ (ƈħȧƞɠḗ ŧḗẋŧ))",
        "remove_custom_style": "řḗḿǿṽḗ Ŧȧƀ şŧẏŀḗ (ƈħȧƞɠḗ ŧḗẋŧ)",
        "custom_tab_info": "ƈŭşŧǿḿ ŧȧƀ īƞƒǿřḿȧŧīǿƞ",
        "remove_tab_info": "řḗḿǿṽḗ ƈŭşŧǿḿ ŧȧƀ īƞƒǿřḿȧŧīǿƞ",
        "hide_tab_bar": "ħīḓḗ Ŧȧƀƀȧř",
        "show_tab_bar": "şħǿẇ Ŧȧƀƀȧř",
        "back": "ƀȧƈķ ŧǿ ƥřḗṽīǿŭş",
        "show_text": "şħǿẇ ŧḗẋŧ ǿƞŀẏ",
        "show_icon_and_selectedIcon": "şħǿẇ īƈǿƞ ȧƞḓ şḗŀḗƈŧḗḓĪƈǿƞ",
        "show_icon": "şħǿẇ īƈǿƞ ǿƞŀẏ",
        "show_selectedIcon": "şħǿẇ şḗŀḗƈŧḗḓĪƈǿƞ"
    },
    //action-sheet
    "action_sheet": {
        "pop_action_sheet": "şħǿẇ ȧƈŧīǿƞ şħḗḗŧ"
    },
    //animation
    "animation": {
        "rotate": "řǿŧȧŧḗ",
        "scale": "şƈȧŀḗ",
        "translate": "ḿǿṽḗ",
        "skew": "şķḗẇ",
        "rotate_and_scale": "řǿŧȧŧḗ ȧƞḓ şƈȧŀḗ",
        "rotate_then_scale": "řǿŧȧŧḗ ŧħḗƞ şƈȧŀḗ",
        "all": "şħǿẇ ȧŀŀ ȧŧ ŧħḗ şȧḿḗ ŧīḿḗ",
        "all_in_queue": "ȧŀŀ īƞ ɋŭḗŭḗ",
        "reset": "řḗşḗŧ"
    },
    //canvas

    //chat

    //choose-contact
    "choose_contact": {
        "choose_contact": "ƈħǿǿşḗ ƈǿƞŧȧƈŧ",
        "is_multi": "ḿŭŀŧī",
        "is_ignore": "īɠƞǿřḗ şḗŀƒ",
        "display_back": "şħǿẇ ƈħǿǿşḗƞ ƈǿƞŧȧƈŧş",
        "external_contact": "contains external contact",
        "name": "ƞȧḿḗ："
    },
    //choose-location
    "choose_location": {
        "current_location": "ƈŭřřḗƞŧ ŀǿƈȧŧīǿƞ īƞƒǿřḿȧŧīǿƞ",
        "not_select_a_location": "ƞǿ ŀǿƈȧŧīǿƞ",
        "selecte_a_location": "şḗŀḗƈŧ ȧ ŀǿƈȧŧīǿƞ",
        "clear": "ƈŀḗȧř"
    },
    //device-authentication
    "device_authentication": {
        "open_system_authentication": "ǿƥḗƞ ŧħḗ şẏşŧḗḿ ŭƞŀǿƈķ īƞŧḗřƒȧƈḗ",
        "unlock_interface": "ŭƞŀǿƈķ īƞŧḗřƒȧƈḗ",
        "unlock_success": "ŭƞŀǿƈķ şŭƈƈḗşş",
        "unlock_fail": "ŭƞŀǿƈķ ƒȧīŀ",
        "cancel": "ƈȧƞƈḗŀ",
        "confirm": "ƈǿƞƒīřḿ"
    },
    //download-file
    "download_file": {
        "download_image": "ḓǿẇƞŀǿȧḓ īḿȧɠḗ",
        "save_image": "şȧṽḗ īḿȧɠḗ",
        "download_video": "ḓǿẇƞŀǿȧḓ ṽīḓḗǿ",
        "save_video": "şȧṽḗ ṽīḓḗǿ"
    },
    //file
    "file": {
        "select_a_file": "ƥŀḗȧşḗ şḗŀḗƈŧ ȧ ƒīŀḗ",
        "save_file": "şȧṽḗ ƒīŀḗ",
        "delete_file": "clear file",
        "unlink_file":"delete file",
        "unzip_file":"unzip file",
        "open_file": "ǿƥḗƞ ƒīŀḗ",
        "check_file": "verifică fișierul există",
        "copy_file": "copiaza fisier",
        "get_file_info": "obțineți informații despre fișiere",
        "get_saved_file_list": "obține lista de fișiere salvate",
        "mk_dir": "creare director",
        "remove_saved_file": "eliminați fișierul salvat",
        "rename": "redenumire",
        "rm_dir": "delete dir",
        "read_dir": "obțineți lista de copii dir",
        "select_docs_lark": "şḗŀḗƈŧ ŀȧřķ ḓǿƈş",
        "select_attachment_lark": "şḗŀḗƈŧ ȧŧŧȧƈħḿḗƞŧ ŀȧřķ",
        "select_attachment_system": "şḗŀḗƈŧ ȧŧŧȧƈħḿḗƞŧ şẏşŧḗḿ",
        "attachment_list": "ȧŧŧȧƈħḿḗƞŧ ŀīşŧ"
    },
    //get-clipboard-data
    "get_clipboard_data": {
        "copy": "ƈǿƥẏ",
        "paste": "ƥȧşŧḗ"
    },
    //get-connected-wifi
    "get_connected_wifi": {
        "network_status": "ƞḗŧẇǿřķ şŧȧŧŭş",
        "not_acquired": "ƞǿŧ ȧƈɋŭīřḗḓ",
        "click_red_button": "ƈŀīƈķ ŧħḗ řḗḓ ƀŭŧŧǿƞ ŧǿ ɠḗŧ ŧħḗ ẇīƒī şŧȧŧŭş",
        "get_current_wifi": "ɠḗŧ ŧħḗ ẇīƒī ƈŭřřḗƞŧŀẏ ƈǿƞƞḗƈŧḗḓ"
    },
    //get-location
    "get_location": {
        "current_location": "Ƈŭřřḗƞŧ ƥǿşīŧīǿƞ ŀȧŧīŧŭḓḗ ȧƞḓ ŀǿƞɠīŧŭḓḗ",
        "not_acquired": "ƞǿŧ ȧƈɋŭīřḗḓ",
        "get_current_location": "ɠḗŧ ƈŭřřḗƞŧ ŀǿƈȧŧīǿƞ",
        "reset": "řḗşḗŧ"
    },
     //get-location-status
    "get_location_status": {
        "current_status": "Current status",
        "not_acquired": "not acquired", 
        "get_current_status": "get current status",
        "reset": "reset"
    },
    //get-network-type
    "get_network_type": {
        "network_status": "ƞḗŧẇǿřķ şŧȧŧŭş",
        "not_acquired": "ƞǿŧ ȧƈɋŭīřḗḓ",
        "click_red_button": "ƈŀīƈķ ŧħḗ řḗḓ ƀŭŧŧǿƞ ŧǿ ɠḗŧ ŧħḗ ẇīƒī şŧȧŧŭş",
        "get_network_type": "ɠḗŧ ƞḗŧẇǿřķ ŧẏƥḗ",
        "reset": "řḗşḗŧ"
    },
    //get-system-info
    "get_system_info": {
        "mobile_phone_brands": "ḿǿƀīŀḗ ƥħǿƞḗ ƀřȧƞḓş",
        "not_acquired": "ƞǿŧ ȧƈɋŭīřḗḓ",
        "phone_model": "ƥħǿƞḗ ḿǿḓḗŀ",
        "device_pixel_ratio": "ḓḗṽīƈḗ ƥīẋḗŀ řȧŧīǿ",
        "window": "ẇīƞḓǿẇ ẇīḓŧħ × ħḗīɠħŧ",
        "screen": "ẇīƞḓǿẇ ẇīḓŧħ × ħḗīɠħŧ",
        "statusbar_height": "şŧȧŧŭşƀȧř ħḗīɠħŧ",
        "app_version": "ȧƥƥ ṽḗřşīǿƞ",
        "system_version": "ǿƥḗřȧŧīǿƞ şẏşŧḗḿ ṽḗřşīǿƞ",
        "system_type": "ǿƥḗřȧŧīǿƞ şẏşŧḗḿ ŧẏƥḗ",
        "sdk_version": "şḓķ ṽḗřşīǿƞ",
        "language": "ŀȧƞɠŭȧɠḗ",
        "font_size": "ƒǿƞŧ şīẑḗ",
        "get_cellphone_system_info": "ȧƈƈḗşş ŧǿ ḿǿƀīŀḗ ƥħǿƞḗ şẏşŧḗḿ īƞƒǿřḿȧŧīǿƞ",
        "clear": "ƈŀḗȧř",
        "sync_get_cellphone_system_info": "şẏƞƈħřǿƞīẑḗ ȧƈƈḗşş ŧǿ ḿǿƀīŀḗ ƥħǿƞḗ şẏşŧḗḿ īƞƒǿřḿȧŧīǿƞ"
    },
    //get-user-info
    "get_user_info": {
        "user_info": "ŭşḗř īƞƒǿřḿȧŧīǿƞ",
        "not_acquired": "ƞǿŧ ȧƈɋŭīřḗḓ",
        "click_red_button": "ƈŀīƈķ ŧħḗ řḗḓ ƀŭŧŧǿƞ ŧǿ ɠḗŧ ŧħḗ ŭşḗř ȧṽȧŧȧř ȧƞḓ ƞīƈķƞȧḿḗ",
        "unencrypted_data": "ŭƞḗƞƈřẏƥŧḗḓ ḓȧŧȧ",
        "encrypted_data": "ḗƞƈřẏƥŧḗḓ ḓȧŧȧ",
        "whether_encrypted": "Ẇħḗŧħḗř ẏǿŭ ƞḗḗḓ ŧǿ ƈȧřřẏ ḗƞƈřẏƥŧḗḓ īƞƒǿřḿȧŧīǿƞ",
        "get_user_info": "ɠḗŧ ŭşḗř īƞƒǿřḿȧŧīǿƞ",
        "clear": "ƈŀḗȧř"
    },
    //image
    "image_api": {
        "camera": "ƈȧḿḗřȧ",
        "album": "ȧŀƀŭḿ",
        "album_or_camera": "ȧŀƀŭḿ ǿř ƈȧḿḗřȧ",
        "origin": "ǿřīɠīƞȧŀ īḿȧɠḗ",
        "compression": "ƈǿḿƥřḗşşīǿƞ",
        "image_source": "īḿȧɠḗ şǿŭřƈḗ:",
        "quantity_limit": "ƈǿŭƞŧ ŀīḿīŧ",
        "preview_image": "ƈŀīƈķ ŧǿ ƥřḗṽīḗẇ ŧħḗ şḗŀḗƈŧḗḓ īḿȧɠḗ",
        "choose_compress_image": "ƈŀīƈķ ŧǿ şḗŀḗƈŧ ŧħḗ īḿȧɠḗ ẏǿŭ ẇȧƞŧ ŧǿ ƈǿḿƥřḗşş",
        "compress_quality": "ƈǿḿƥřḗşşḗḓ īḿȧɠḗ (ɋŭȧŀīŧẏ 50)",
        "get_image_info": "ɠḗŧ īḿȧɠḗ īƞƒǿřḿȧŧīǿƞ"
    },
    //inneraudio
    "inneraudio": {
        "buffered_audio": "ƀŭƒƒḗřḗḓ",
        "total_length": "ŧǿŧȧŀ ŀḗƞɠŧħ",
        "control_parameter": "ƈǿƞŧřǿŀ ƥȧřȧḿḗŧḗř",
        "whether_to_cycle": "ẇħḗŧħḗř ŧǿ ƈẏƈŀḗ",
        "follow_the_system_mute": "ẇħḗŧħḗř ŧǿ ƒǿŀŀǿẇ ŧħḗ şẏşŧḗḿ ḿŭŧḗ"
    },
    //keep-screen-brightness
    "screen_brightness": {
        "constantly_bright": "ƈǿƞşŧȧƞŧŀẏ ƀřīɠħŧ",
        "light_out": "ŀīɠħŧ ǿŭŧ",
        "get_screen_brightness": "ɠḗŧ şƈřḗḗƞ ƀřīɠħŧƞḗşş",
        "set_screen_brightness": "şḗŧ şƈřḗḗƞ ƀřīɠħŧƞḗşş"
    },

    //live-check
    "live_check": {
        "live_check_nosource": "ƞǿ şǿŭřƈḗ ŀīṽḗ ƈħḗƈķ",
    },

    //login
    "login": {
        "has_login": "ħȧş ŀǿɠɠḗḓ",
        "has_login_tip": "Ḗȧƈħ ŭşḗř ǿƞŀẏ ƞḗḗḓş ŧǿ ŀǿɠ īƞ ǿƞƈḗ, ȧƞḓ ḗȧƈħ ŧīḿḗ ŧħḗẏ ḗƞŧḗř ŧħḗ ƥȧɠḗ, ŧħḗẏ ƈȧƞ ȧŭŧǿḿȧŧīƈȧŀŀẏ ƥŭŀŀ ŭşḗř īƞƒǿřḿȧŧīǿƞ ȧƈƈǿřḓīƞɠ ŧǿ ŧŧīḓ.",
        "no_login_tip": "Ƞǿŧ ŀǿɠɠḗḓ īƞ ǿř ŧħḗ ƈŭřřḗƞŧ şḗşşīǿƞ ħȧş ḗẋƥīřḗḓ ȧƞḓ ƞḗḗḓş ŧǿ ƀḗ ŀǿɠɠḗḓ īƞ ȧɠȧīƞ",
        "login": "ŀǿɠīƞ"
    },
    //mailto
    "mailto": {
        "send_email": "şḗƞḓ ḗḿȧīŀ"
    },
    //make phone call
    "make_phone_call": {
        "enter_phone_number": "Ƥŀḗȧşḗ ḗƞŧḗř ŧħḗ ƥħǿƞḗ ƞŭḿƀḗř ƀḗŀǿẇ",
        "call": "ƈȧŀŀ"
    },
    //modal
    "modal": {
        "modal_with_title": "ḿǿḓȧŀ ẇīŧħ ŧīŧŀḗ",
        "modal_without_title": "ḿǿḓȧŀ ẇīŧħǿŭŧ ŧīŧŀḗ",
        "modal_title": "ḿǿḓȧŀ ŧīŧŀḗ",
        "modal_content": "Ƥǿƥ ŭƥ ŧħḗ ẇīƞḓǿẇ ƈǿƞŧḗƞŧ, ḓḗşƈřīƀḗ ŧħḗ ŧḗẋŧ ȧş ḿŭƈħ ȧş ƥǿşşīƀŀḗ īƞ ŧħřḗḗ ŀīƞḗş",
        "confirm": "ƈǿƞƒīřḿ",
        "cancel": "ƈȧƞƈḗŀ"
    },
    //prompt
    "prompt": {
        "prompt_with_title": "ƥřǿḿƥŧ ẇīŧħ ŧīŧŀḗ",
        "prompt_without_title": "ƥřǿḿƥŧ ẇīŧħǿŭŧ ŧīŧŀḗ",
        "prompt_title": "ḿǿḓȧŀ ŧīŧŀḗ",
        "confirm": "ƈǿƞƒīřḿ",
        "cancel": "ƈȧƞƈḗŀ"
    },
    //navigator
    "navigator_api": {
        "current_page_identifier": "ƈŭřřḗƞŧ ƥȧɠḗ īḓḗƞŧīƒīḗř",
        "lifecycle": "ƞȧṽīɠȧŧḗŦǿ (ƈȧƞ ĵŭḿƥ ŧǿ ŧħḗ şȧḿḗ ƥȧɠḗ ḿŭŀŧīƥŀḗ ŧīḿḗş ƀŭŧ ẇīŧħ ḓīƒƒḗřḗƞŧ ŀīƒḗƈẏƈŀḗş)"
    },
    //on-accelerometer-change
    "on_accelerometer_change": {
        "tip": "Ŧīŀŧ ŧħḗ ƥħǿƞḗ ŧǿ ḿǿṽḗ ŧħḗ ƀȧŀŀ ƀḗŀǿẇ"
    },
    //on-compass-change
    "on_compass_change": {
        "tip": "Řǿŧȧŧḗ ẏǿŭř ƥħǿƞḗ ŧǿ ɠḗŧ ŀǿƈȧŧīǿƞ īƞƒǿřḿȧŧīǿƞ",
        "start_listening": "şŧȧřŧ ŀīşŧḗƞīƞɠ",
        "stop_listening": "şŧǿƥ ŀīşŧḗƞīƞɠ"
    },
    //on-network-status-change
    "on_network_status_change": {
        "network_status": "ƞḗŧẇǿřķ şŧȧŧŭş",
        "no_internet_connection": "ƞǿ īƞŧḗřƞḗŧ ƈǿƞƞḗƈŧḗḓ"
    },
    //on-user-capture-screen
    "on_use_capture_screen": {
        "please_capture": "Ƥŀḗȧşḗ ŧȧķḗ ȧ şƈřḗḗƞ şħǿŧ",
        "cancel_listening": "ƈȧƞƈḗŀ ŀīşŧḗƞīƞɠ",
        "no_triggered": "Şƈřḗḗƞ ƈȧƥŧŭřḗ ḗṽḗƞŧ ƞǿŧ ŧřīɠɠḗřḗḓ",
        "has_cancel": "Şƈřḗḗƞ ƈȧƥŧŭřḗ ħȧş ƀḗḗƞ ƈȧƞƈḗŀŀḗḓ",
        "has_triggered": "Şƈřḗḗƞ ƈȧƥŧŭřḗ ḗṽḗƞŧ ħȧş ƀḗḗƞ ŧřīɠɠḗřḗḓ"
    },
    //open-location
    "open_location": {
        "longitude": "ŀǿƞɠīŧŭḓḗ",
        "latitude": "ŀȧŧīŧŭḓḗ",
        "location_name": "ŀǿƈȧŧīǿƞ ƞȧḿḗ",
        "detailed_location": "ḓḗŧȧīŀḗḓ ŀǿƈȧŧīǿƞ",
        "view_location": "ṽīḗẇ ŀǿƈȧŧīǿƞ"
    },
    //page-scroll-to 

    //password_verify
    "password_verify": {
        "password_verify": "Şŧȧřŧ ƥȧşşẇǿřḓ ṽḗřīƒẏ"
    },
    //pull-down-refresh
    "pull_down_refresh": {
        "pull_down": "Şŀīḓīƞɠ ƥȧɠḗ ŧǿ řḗƒřḗşħ",
        "start_refresh": "şŧȧřŧ řḗƒřḗşħ",
        "stop_refresh": "şŧǿƥ řḗƒřḗşħ",
        "disable_refresh": "disable refresh",
        "enable_refresh": "enable refresh"
    },
    //request
    "request": {
        "request": "Ƈŀīƈķ ŧǿ ḿȧķḗ ȧ řḗɋŭḗşŧ ŧǿ ŧħḗ şḗřṽḗř"
    },
    //scan-code
    "scan_code": {
        "scan_result": "şƈȧƞ ƈǿḓḗ řḗşŭŀŧ",
        "scan": "şƈȧƞ"
    },
    //set-navigation-bar-title
    "set_navigation_bar_title": {
        "page_title": "ƥȧɠḗ ŧīŧŀḗ",
        "enter_title": "Ƥŀḗȧşḗ ḗƞŧḗř ŧħḗ ƥȧɠḗ ŧīŧŀḗ ȧƞḓ ƈŀīƈķ ǿƞ Şḗŧŧīƞɠş.",
        "set": "şḗŧ"
    },
    //share
    "share": {
        "send_content": "şḗƞḓ ƈǿƞŧḗƞŧ (ŧħḗ ƒǿŀŀǿẇīƞɠ ƒīḗŀḓş ȧřḗ ƒřḗḗŀẏ ȧḓȧƥŧȧƀŀḗ)",
        "describe": "ḓḗşƈřīƥŧīǿƞ",
        "share_path": "şħȧřḗ ƥȧŧħ",
        "share_to_friend": "ƈŀīƈķ ŧħḗ ḿḗƞŭ īƞ ŧħḗ ŧǿƥ řīɠħŧ ƈǿřƞḗř ŧǿ şħȧřḗ ẇīŧħ ƒřīḗƞḓş",
        "click_share_button": "ƈŀīƈķ ƀŭŧŧǿƞ ŧǿ şħȧřḗ",
        "show_top_share_button": "şħǿẇ ŧǿƥ şħȧřḗ ƀŭŧŧǿƞ",
        "hide_top_share_button": "ħīḓḗ ŧǿƥ şħȧřḗ ƀŭŧŧǿƞ",
        "custom_share_describe": "Ƈŭşŧǿḿ şħȧřḗ ḓḗşƈřīƥŧīǿƞ",
        "button_share": "ƀŭŧŧǿƞ şħȧřḗ",
        "menu_share": "ḿḗƞŭ şħȧřḗ"
    },
    //storage
    "storage": {
        "enter_key_placeholder": "Ƥŀḗȧşḗ ḗƞŧḗř ŧħḗ ķḗẏ",
        "enter_value_placeholder": "Ƥŀḗȧşḗ ḗƞŧḗř ṽȧŀŭḗ",
        "store_data": "şŧǿřīƞɠ ḓȧŧȧ",
        "get_data": "řḗȧḓ ḓȧŧȧ",
        "clear_data": "ƈŀḗȧƞ ŭƥ ḓȧŧȧ",
        "clear_all_data": "ƈŀḗȧƞ ŭƥ ȧŀŀ ḓȧŧȧ",
        "get_cached_data": "ɠḗŧ ƈȧƈħḗḓ ḓȧŧȧ īƞƒǿřḿȧŧīǿƞ",
        "sync_get_cached_data": "şẏƞƈħřǿƞǿŭşŀẏ ɠḗŧ ƈȧƈħḗḓ ḓȧŧȧ īƞƒǿřḿȧŧīǿƞ"
    },
    //toast
    "toast": {
        "default_toast": "ḓḗƒȧŭŀŧ ŧǿȧşŧ,şḗŧ ŧīŧŀḗ",
        "hide_toast": "ƈŀīƈķ ȧƞḓ ħīḓḗ ŧǿȧşŧ"
    },
    //upload-file
    "upload_file": {
        "select_photo": "ƈħǿǿşḗ ƥħǿŧǿ"
    },
    //vibrate
    "vibrate": {
        "short_vibrate": "şħǿřŧ ṽīƀřȧŧḗ",
        "long_vibrate": "ŀǿƞɠ ṽīƀřȧŧḗ"
    },
    //video
    "video": {
        "video_source": "ṽīḓḗǿ şǿŭřƈḗ",
        "camera": "ƈȧḿḗřȧ",
        "shooting_length": "şħǿǿŧīƞɠ ŀḗƞɠŧħ",
        "add_video": "ȧḓḓ ṽīḓḗǿ",
        "album": "ȧŀƀŭḿ",
        "camera_or_album": "ƈȧḿḗřȧ ǿř ȧŀƀŭḿ"
    },
    //voice

    //watermark
    "watermark": {
        "tip": "Ƈħḗƈķ īƒ ŧħḗ ẇȧŧḗřḿȧřķ īş ḓīşƥŀȧẏḗḓ"
    },
    //web-socket
    "web_socket": {
        "socket_status": "şǿƈķḗŧ şŧȧŧŭş",
        "message": "ḿḗşşȧɠḗ",
        "custom_message": "ƈŭşŧǿḿ ḿḗşşȧɠḗ",
        "send_message": "şḗƞḓ ḿḗşşȧɠḗ",
        "tip": "Ḓīşƥŀȧẏ ḿḗşşȧɠḗ: şḗƞḓ [şḗƞḓ] řḗƈḗīṽḗ [řḗƈḗīṽḗ]\ƞ"
    },
    //PC mode
    "mode": {
        "feed_mode": "Ƒḗḗḓ ḿǿḓḗ"
    },
    "feed": {
        "app_notify_tip": "Ḗƞŧḗř ŧħḗ ƈǿƞŧḗƞŧ ŧǿ şḗƞḓ ȧƥƥ ƞǿŧīƒīƈȧŧīǿƞş",
        "select_start_page_tip": "Şḗŀḗƈŧ ŧħḗ ƥȧɠḗ ŧǿ ḗƞŧḗř ƒḗḗḓ ḿǿḓḗ",
        "send_notification_tip": "Ƈŀīƈķ ŧħḗ ƀŭŧŧǿƞ ŧǿ şḗƞḓ ȧƞ ȧƥƥ ƞǿŧīƒīƈȧŧīǿƞ ŧǿ ẏǿŭřşḗŀƒ",
        "enter_feed_mode_tip": "Ƈŀīƈķ ǿƞ ŧħḗ ȧƥƥ ḿḗşşȧɠḗ īƞ ŧħḗ ƒḗḗḓ ŀīşŧ ŧǿ ḗƞŧḗř ŧħḗ ƒḗḗḓ ḿǿḓḗ"
    },
    // createIntersectionObserver
    "create_intersection_observer": {
      "ball_appear": "Ŧħḗ ƀȧŀŀ ȧƥƥḗȧřş",
      "ball_disappear": "Ŧħḗ ƀȧŀŀ ḓīşȧƥƥḗȧřş",
      "tip": "Şẇīƥḗ ŭƥ ǿř řǿŀŀ ŭƥ ŧǿ ḿȧķḗ ŧħḗ ƀȧŀŀ ȧƥƥḗȧř"
    },
    // NFC API
    "nfc_api": {
        "start_discovery": "Start NFC Discovery",
        "on_discovery": "On Discovery Listener For Nfc",
        "stop_discovery": "Stop NFC Discovery",
        "nfca_getatqa": "Get NFC-A Atqa Info",
        "nfca_getsak": "Get NFC-A Sak Info",
        "nfca_set_timeout": "NFC-A Set Timeout",
        "nfca_get_max_transceive_length": "Get NFC-A Transceive Length",
        "nfca_transceive_auth": "Use Transceive to auth",
        "nfca_close": "Close NFC-A connect",
        "nfca_transceive_read": "Use Transceive to read",
        "nfca_transceive_write": "Use Transceive to write"
      },
    // camera component
    "cameraComponent": {
        "take_photo": "Take Photo",
        "start_record": "Start Record",
        "stop_record": "Stop Record",
        "preview_image": "Preview Image",
        "preview_tips": "Preview"
      },
}

export default rw;